In [1]:
import pandas as pd

In [2]:
#Sales Representatives Table (Parent
sales_reps = pd.DataFrame({
    "rep_id": [1, 2, 3],
    "name":["Alice","Bob","Charlie"],
    "region": ["North","South","West"]
})

In [6]:
# Sales Data Table(Child)
sales = pd.DataFrame({
    "sale_id": [101, 102, 103, 104],
    "sale_rep_id":[1, 2, None, 4],#Incudes a missing and an unmatched ID
    "sale_amount": [500,1000, 750, 1200]
})

In [4]:
sales_reps

   rep_id     name region
0       1    Alice  North
1       2      Bob  South
2       3  Charlie   West

In [7]:
sales

   sale_id  sale_rep_id  sale_amount
0      101          1.0          500
1      102          2.0         1000
2      103          NaN          750
3      104          4.0         1200

In [9]:
inner_join = pd.merge(
    sales_reps,
    sales,
    left_on="rep_id",
    right_on="sale_rep_id",
    how="inner"
)

In [10]:
inner_join

   rep_id   name region  sale_id  sale_rep_id  sale_amount
0       1  Alice  North      101          1.0          500
1       2    Bob  South      102          2.0         1000

In [11]:
sales_by_region = inner_join.groupby("region")["sale_amount"].sum().reset_index()

In [12]:
sales_by_region

  region  sale_amount
0  North          500
1  South         1000

In [13]:
inner_join.shape

(2, 6)